art_share_api/app/controllers/users_controller.rb

INSERT INTO "users" ("name", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["name", "Teapott"], ["created_at", "2023-02-16 17:09:28.509992"], ["updated_at", "2023-02-16 17:09:28.509992"]]
---
	def create
		@user = User.new(user_params)
		if @user.save